var data = [];
var dataStr = '1、<br>\
<br>\
<b>Web应用程序测试</b><br>\
·随着Web应用开发技术和应用水平的飞速发展，用户对Web系统的功能、性能、安全性、稳定性等提出了<br>\
更高的要求。Web应用程序在发布之前必须进行深入全面的测试。本书从理论、技术、实战和工具4个方<br>\
面深入详实地介绍Web应用程序测试全过程。<br>\
<br>\
<br>\
2、<br>\
<br>\
	<b>生命的足迹</b><br>\
·中英双语大学生励志与心理健康读本《The Footprints of Life Classic Edition》的出版是希望通过对理想、幸福、<br>\
人生、励志、成功、亲情、友情、爱情、心灵成长、哲理、公民与社会责任的诠释，对当代大学生进行励志与思想健康教育。<br>\
<br>\
<br>\
3、<br>\
<br>\
	<b>成长之路</b><br>\
·本书涉及到软件测试领域的方方面面，同时紧随国际软件测试最新的技术，有一定的前瞻性，技术研究深入，方便引导读<br>\
者进入到高级工程师行列。软件测试工程师各大技术主题分享，为每一位读者从初级测试工程师向中高级测试工程师发展指明了道路。<br>\
<br>\
<br>\
4、<br>\
<br>\
	<b>软件测试全程项目实战宝典</b><br>\
·本书适合想从事软件测试行业或已经进入软件测试行业，但不懂如何实践，不知道软件测试工程师日常工作及所需要的技术或技巧的人，书籍中展示的各种技术，能满足软<br>\
件测试日常工作所需。纵使有多年工作经验的软件测试工程师，也能在本书中找到灵感与共鸣，提高自身的测试技能与开拓测试视野。<br>\
<br>\
<br>\
5、<br>\
<br>\
	<b>Web网站漏洞扫描与渗透攻击工具揭秘</b><br>\
·本书精心选材，视野开阔，对Web安全领域网站漏洞扫描与渗透攻击流行工具进行深入剖析与揭密。近些年来，国内与国际Web安全领域纷繁复杂，各种攻击方式层出<br>\
不穷，给人以“乱花渐欲迷人眼”的感觉，而本书的出版希望能帮助读者理解乱象丛生的Web安全现状，做到“拨开云雾始见天”！<br>\
<br>\
<br>\
6、<br>\
<br>\
	<b>JavaEE篇</b><br>\
·以实际项目为原型，以关键的理论与丰富的实践为指导，贯彻了先进的项目管理理念与全程质量管理思想。以一个完整软件项目为实例，<br>\
对软件测试工程师的日常工作进行详细的介绍，帮助读者掌握各种技术并能灵活地使用和扩展这些技术。<br>\
<br>\
<br>\
7、<br>\
<br>\
	<b>ASP.NET篇</b><br>\
·以实际项目为原型，以关键的理论与丰富的实践为指导，贯彻了先进的项目管理理念与全程质量管理思想。以一个完整软件项目为实例，对软件测<br>\
试工程师的日常工作进行详细的介绍，帮助读者掌握各种技术并能灵活地使用和扩展这些技术。<br>\
<br>\
<br>\
8、<br>\
<br>\
	<b>ASP.NET篇（第2版）</b><br>\
·以实际项目为原型，以关键的理论与丰富的实践为指导，贯彻了先进的项目管理理念与全程质量管理思想。以一个完整软件项目为实例，对<br>\
软件测试工程师的日常工作进行详细的介绍，帮助读者掌握各种技术并能灵活地使用和扩展这些技术。<br>\
<br>\
<br>\
9、<br>\
<br>\
	<b>JavaEE篇（第2版）</b><br>\
·以实际项目为原型，以关键的理论与丰富的实践为指导，贯彻了先进的项目管理理念与全程质量管理思想。以一个完整软件项目为实例，对软件测<br>\
试工程师的日常工作进行详细的介绍，帮助读者掌握各种技术并能灵活地使用和扩展这些技术。<br>\
<br>\
<br>\
10、<br>\
<br>\
	<b>ASP.NET篇（第3版）</b><br>\
·第3版的出版秉承第1版与第2版的优点，从整个软件生命周期与全程质量管理的角度，阐述测试工程师在各个阶段的主要工作，以及每一阶段所起的作用<br>\
。同时增加软件测试工程师各大技术主题分享，为每一位读者从初级测试工程师向中高级测试工程师发展指明了道路。<br>\
<br>\
<br>\
11、<br>\
<br>\
	<b>JavaEE篇（第3版）</b><br>\
·第3版的出版秉承第1版与第2版的优点，从整个软件生命周期与全程质量管理的角度，阐述测试工程师在各个阶段的主要工作，以及每一阶段所起的作<br>\
用。同时增加软件测试工程师各大技术主题分享，为每一位读者从初级测试工程师向中高级测试工程师发展指明了道路。<br>\
<br>\
<br>\
12、<br>\
<br>\
	<b>生命的足迹经典版</b><br>\
·便于学生朗读，学生在朗读这些优秀作品时，一方面增长了自己的智慧，给自己以无限的力量，努力把握好生命中的每一天；<br>\
另一方面对英语学习中涉及的听、说、写、读、译各方面都有很大提高。同时学生家长也可以成为受益群体，引导孩子正确<br>\
看待人生所经历的一切，引领孩子健康成长。<br>\
<br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', '') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
    //console.log(c[0].replace('、', ' ') + '.jpg');
};